Cylinder_blockMesh_heatWallFlux_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc solverInfo
   	wallHeatFlux
	{
		type    wallHeatFlux;
		libs    ("libfieldFunctionObjects.so");
		region    region0;
		writeControl    outputTime;
		patches    ();
	}

	physicalHTC
	{
		type    heatTransferCoeff;
		libs    ("libfieldFunctionObjects.so");
		region    region0;
		writeControl    outputTime;
		field    T;
		patches    ( walls );
		htcModel    fixedReferenceTemperature;
		TRef    330;
	}
}
// ************************************************************************* //
