Cylinder_blockMesh_heatWallFlux_base/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 1 -1 -2 0 0 0 0 ];
internalField    uniform 101325;
boundaryField
{
	#includeEtc    "caseDicts/setConstraintTypes";
	".*"
	{
		type    calculated;
		value    uniform 101325;
	}

}


// ************************************************************************* //
