Cylinder_blockMesh_heatWallFlux_base/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions    [ 1 -1 -2 0 0 0 0 ];
internalField    uniform 101325;
boundaryField
{
	#includeEtc    "caseDicts/setConstraintTypes";
	walls
	{
		type    fixedFluxPressure;
		value    uniform 101325;
	}

	inlet
	{
		type    fixedFluxPressure;
		value    uniform 101325;
	}

	outlet
	{
		type    fixedValue;
		value    uniform 101325;
	}

}


// ************************************************************************* //
